% Problem 5 modified Newton Raphson %για ερωτηση 2,3,4

clear; clc; close all;
x1=sym("x1");
x2=sym("x2");
x_0=sym("x_0");
a=sym("a");
fx = (x1 - 2*x2)^2 +2*x1*x2 -2*x2 + 1; %οταν αλλαζω την fx πρεπει να αλλαξω το x0,x1,x2
x_0=[2;1];   %το χ0 που μας δινεται απο την εκφωνηση
x1_0=2;      % ο πρωτς αριθμος απο το χ0 που μας δοθηκε στην εκφωνηση ειναι το χ1 ΣΟΣΟΣΟΣ να αλλαζεται 
x2_0=1;     %ο δευτερος αριθμος που μας δινει το χ0 στην εκφωνηση ειναι το χ2 ΣΣΟΣΟΣΟΣ να αλλαζεται 
c = [diff(fx,x1);diff(fx,x2)]
c_0 = subs(c,[x1,x2],[x1_0 x2_0])
d_0 = -c_0
x1_0=x_0+a*d_0
fa=subs(fx,[x1,x2],[x1_0(1),x1_0(2)])
fa_der=[diff(fa,a)]
a_value=solve([fa_der==0],a)
x1_0=subs(x1_0,[a],a_value)

%στο command window το cx ειναι η απαντηση για ενα πολλαπλης {ερ2)
% στο fa αν ανοιξω λιγο τις πραξεις εχω το επομενο πολλαπλης (ερ3)
%στο χ1_0 εχω την απαντηση για την ερωτηση 4